Revit 2027 API
BuiltInFailures.PointFailures.CannotMakePointHostedByIntersection Property
 Cannot make point hosted by intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakePointHostedByIntersection { get; }
Public Shared ReadOnly Property CannotMakePointHostedByIntersection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakePointHostedByIntersection {
	FailureDefinitionId^ get ();
}
static member CannotMakePointHostedByIntersection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace